Revit 2026 API

# CompoundStructureParticipatesInWrapping Method

---

Identifies if a layer is included in wrapping at inserts and ends.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ParticipatesInWrapping(
	int layerIdx
)
```
```vb
Public Function ParticipatesInWrapping (
	layerIdx As Integer
) As Boolean
```
```cpp
public:
bool ParticipatesInWrapping(
	int layerIdx
)
```
```fsharp
member ParticipatesInWrapping :
        layerIdx : int -> bool
```

#### Parameters

layerIdx Int32
     Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

#### Return Value

Boolean If true, then the layer participates in wrapping at inserts and openings. If false, the layer will not participate in wrapping.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The layer index is out of range. |

This method applies only to interior and exterior shell layers.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace